<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"038d68889d84a3eb232d1f97ab320643b8b08145ff66e8c182d7590b9a4abfb2","plan_job_ref":"Job Plan Airflow DAGs #476 at https://github.com/cal-itp/data-infra/actions/runs/16945959388","plan_out_hash":"02b381af10d3796fa9a5c8429a3ba6ce1dbb1b6a8556a1c93532b43628cd32f0","plan_hash":"8c8df2c250549ea274499a40c36d78f549c065e13d294f66f0e063dd9102737a","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "q5Hk9g==" -> (known after apply)
!~      detect_md5hash      = "XfWeOdWr9iG0xkyuAlekHw==" -> "different hash"
!~      generation          = 1755027055897210 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "XfWeOdWr9iG0xkyuAlekHw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/benefits/fct_benefits_events.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "YjOIXw==" -> (known after apply)
!~      detect_md5hash      = "as6RfOH2oZKs7Yaae+ZE0g==" -> "different hash"
!~      generation          = 1754938420627498 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/benefits/fct_benefits_events.sql"
!~      md5hash             = "as6RfOH2oZKs7Yaae+ZE0g==" -> (known after apply)
        name                = "data/warehouse/models/mart/benefits/fct_benefits_events.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "vHzojg==" -> (known after apply)
!~      detect_md5hash      = "YFPjc4BjjCDWgtPfUFBHKg==" -> "different hash"
!~      generation          = 1755027057605758 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "YFPjc4BjjCDWgtPfUFBHKg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #476](https://github.com/cal-itp/data-infra/actions/runs/16945959388)